<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Super, creates a package, and imports it into Munki</string>
    <key>Identifier</key>
    <string>com.colorcreative.autopkg.munki.super</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.colorcreative.autopkg.download.super</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>root_path</key>
                <string>%RECIPE_CACHE_DIR%/Super</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Super.pkg</string>
                <key>id</key>
                <string>com.colorcreative.Super</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/Super/super</string>
                <key>destination</key>
                <string>%RECIPE_CACHE_DIR%/Super/usr/local/bin/super</string>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>root</key>
                <string>%RECIPE_CACHE_DIR%/Super</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Super.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Super.pkg</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
