<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Munki and Munki Rebrand, processes the rebranding, and imports the output package into Munki</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.munki-rebranded</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <array>
        <string>com.github.autopkg.download.munki</string>
        <string>com.github.autopkg.download.munki-rebrand</string>
    </array>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>executable</key>
                <string>/usr/bin/python3</string>
                <key>icon_file</key>
                <string>%RECIPE_DIR%/color_logo.png</string>
                <key>input_pkg</key>
                <string>%pathname%</string>
                <key>rebrand_script</key>
                <string>%RECIPE_CACHE_DIR%/com.github.autopkg.download.munki-rebrand/munki_rebrand.py</string>
            </dict>
            <key>Processor</key>
            <string>%RECIPE_DIR%/../CustomProcessors/RebrandedMunkiPkgCreator.py</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
