<?xml version="1.0" encoding="utf-8"?>
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the downloaded GitHub release into the Munki repo for any software.</string>
    
    <key>Identifier</key>
    <string>com.github.autopkg.munki.generic-github-release</string>
    
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%munki_repo_subdir%</string>
        <key>NAME</key>
        <string>%NAME%</string>
        <key>catalog</key>
        <string>%catalog%</string>
    </dict>
    
    <key>MinimumVersion</key>
    <string>1.0</string>
    
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download-latest-github-release</string>
    
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>  <!-- Corrected to match the actual download path -->
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>%catalog%</string>
                    </array>
                    <key>description</key>
                    <string>Installs the latest version of %NAME%.</string>
                    <key>display_name</key>
                    <string>%NAME%</string>
                    <key>name</key>
                    <string>%NAME%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
