<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Loupedeck.</string>
	<key>Identifier</key>
	<string>com.github.colorcreative.download.Loupedeck</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Loupedeck</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://support.loupedeck.com/hubfs/Knowledge%20Base/LD%20Software%20Downloads/5.3/Loupedeck%205.3.0.14093.dmg?__hstc=258665239.b5eab8f39845cd8db3fe3424bff9e8b3.1665427884074.1665427884074.1665427884074.1&amp;__hssc=258665239.1.1665427884074&amp;__hsfp=2875269484&amp;_gl=1*114etu*_up*MQ..&amp;gclid=Cj0KCQjwhY-aBhCUARIsALNIC05_KFpsNLDaig3pW30rRfDw8tZ0tATXu8SMm48PZouIo0MEHKFjX78aAoVJEALw_wcB</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Loupedeck Oy (M24R8BN5BK)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/LoupedeckInstaller.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/LoupedeckInstaller.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/LoupedeckPackageInstaller.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Loupedeck.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
