<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Grammarly Desktop and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.colorcreative.pkg.GrammarlyDesktop</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Grammarly Installer</string>
		<key>NAME</key>
		<string>Grammarly Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.colorcreative.download.GrammarlyDesktop</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.colorcreative.download.GrammarlyDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>775d2d361c5398aa38d14fd122c0f74c8e1736ed</string>
				<key>path</key>
				<string>~/Documents/munki_repo/color_recipes/Grammarly Desktop/Grammarly Desktop.download.recipe</string>
				<key>sha256_hash</key>
				<string>0617b45b0aa1dbcbca816ad338241acf2eb942c5293264a92f31e593ba0d7482</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
